app/controllers/map_controller.rb

  def new
    newMap=Map.create()
---
INSERT INTO "maps" ("country", "created_at", "lat", "lng", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?)  [["country", nil], ["created_at", Sun, 24 Feb 2013 01:40:58 UTC +00:00], ["lat", nil], ["lng", nil], ["updated_at", Sun, 24 Feb 2013 01:40:58 UTC +00:00], ["value", nil]]

  def show
    @map=Map.find(params[:id])
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "30"]]

  def update
    map=Map.find(params[:id])

    map.update_attributes(
      :country=>params[:map][:country],
      :value=>params[:map][:value],
      :lat=>params[:map][:lat],
      :lng=>params[:map][:lng]
    )
    if params[:markers]
      params[:markers].each do |k,v|
        m=Marker.where(:map_id=>params[:id],:markerId=>k ).first_or_create do |marker|
          marker.lat=v[:lat]
          marker.lng=v[:lng]
          marker.value=v[:value]
          marker.map_id=v[:map_id]
          marker.markerId=v[:markerId]
        end
        m.update_attributes(
          :lat=>v[:lat],
          :lng=>v[:lng],
          :value=>v[:value],
          :map_id=>v[:map_id],
          :markerId=>v[:markerId]
        )
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "30"]]
UPDATE "maps" SET "country" = 'CA', "value" = 'Britainville, ON, Canada', "lat" = '45.7320459', "lng" = '-82.40214600000002', "updated_at" = '2013-02-24 06:30:03.516928' WHERE "maps"."id" = 23
SELECT "markers".* FROM "markers" WHERE "markers"."map_id" = 30 AND "markers"."markerId" = 0 ORDER BY created_at DESC LIMIT 1
INSERT INTO "markers" ("created_at", "lat", "lng", "map_id", "markerId", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "markers" SET "lat" = '37.63054716639914', "lng" = '-122.42271423339844', "value" = 'Interstate 380 & El Camino Real, San Bruno, CA 94066, USA', "updated_at" = '2013-02-24 05:02:14.321933' WHERE "markers"."id" = 1

  def loadMarkers
    markers=Map.find(params[:id]).markers
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "30"]]
SELECT "markers".* FROM "markers" WHERE "markers"."map_id" = 30 ORDER BY created_at DESC