app/views/map/show.html.erb

SELECT "markers".* FROM "markers" WHERE "markers"."map_id" = 30 ORDER BY created_at DESC
---
      <div class="label"><span><%=marker.markerId%></span></div>
      <input type="text" marker=<%=marker.markerId%> value="<%=marker.value%>" placeholder="City/Village/Town"  />